Revit 2026 API

# TextBoxEnterPressedEventArgs Properties

---

The TextBoxEnterPressedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Application | The current UIApplication. (Inherited from RibbonItemEventArgs) |

#### Reference

TextBoxEnterPressedEventArgs Class

Autodesk.Revit.UI.Events Namespace